huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    // Daily schedule reminders (hour, minute, message, emotion).
    struct ScheduleEntry {
        int hour;
        int minute;
        const char* message;
        const char* emotion;
    };
    static const ScheduleEntry kScheduleReminders_[];
    static constexpr size_t kScheduleCount = 5;

    static constexpr const char* kDrinkReminderMessage = "该喝水了~";
    static constexpr const char* kDrinkReminderEmotion = "delicious";  // water/drink-oriented

    // Touch swipe detection for CST816S
    bool swipe_start_recorded_ = false;
    int64_t touch_press_time_ms_ = 0;
    int swipe_start_x_ = 0;
    int swipe_start_y_ = 0;
    static constexpr int kSwipeThreshold = 80;  // Minimum swipe distance

    // Outer capacitive "pet" surface feedback cooldown (moved from a hidden
    // static local so it is not hidden state).
    static constexpr int64_t kOuterTouchCooldownUs = 1200000;  // 1200 ms
    int64_t outer_touch_last_us_ = 0;

    // Settings page state. settings_selected_index_ picks the active row
    // (0 = brightness, 1 = volume); settings_adjusting_ toggles whether the
    // highlight moves or the active setting's value is adjusted live.
    int settings_selected_index_ = 0;
    bool settings_adjusting_ = false;
    int volume_ = 50;  // cached output volume (0-100); used until codec is ready

    // Display presentation owner. Higher layers take priority and are restored
    // by ResetToStandby(), so transient/mode/reminder feedback do not clobber
    // each other or the standby idle animation (spec §3.4).
    enum class Presentation {
        Standby,            // idle pet animation (lowest priority)
        Mode,               // mode presentation (function/settings/emotion-learning)
        Reminder,           // active reminder (highest priority)
        TransientFeedback,  // short touch/shake feedback
    };
    Presentation presentation_ = Presentation::Standby;

    // Unified interaction mode state. mode_ is read/written only from the
    // interaction task/callback context (touch events and timer callbacks),
    // so it does not require locking.
    Mode mode_ = Mode::Chat;
    static constexpr uint64_t kModeIdleTimeoutMs = 30000;  // Idle timeout (ms) before returning to chat
    esp_timer_handle_t mode_idle_timer_ = nullptr;

    // Two-level power save (spec §6.1). Level 1 is a 1s tick that turns off the
    // display after DISPLAY_SLEEP_TIMEOUT_SECONDS of eligible idle while keeping
    // the wake word available. Level 2 reuses the common PowerSaveTimer for a
    // light sleep after LIGHT_SLEEP_TIMEOUT_SECONDS, gated by UpdatePowerSaveEligibility().
    PowerSaveTimer* power_save_timer_ = nullptr;
    esp_timer_handle_t display_sleep_timer_ = nullptr;
    int display_idle_ticks_ = 0;      // seconds since the last eligible interaction
    bool display_sleep_active_ = false;  // level-1 display sleep is on
    static constexpr int kDisplaySleepTimeoutSeconds = DISPLAY_SLEEP_TIMEOUT_SECONDS;
    static constexpr int kLightSleepTimeoutSeconds = LIGHT_SLEEP_TIMEOUT_SECONDS;

    static void mode_idle_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr || self->mode_ == Mode::Chat || self->reminder_active_) {
            return;
        }
        self->ExitToChat();
    }

    void OnGesture(Gesture gesture)
    {
        // Any normalized gesture is interaction: reset both power-save countdowns
        // and wake the display if it had fallen to level-1 sleep (spec §6.2).
        TouchPowerSaveActivity();
        ResetModeIdleTimer();
        // Reminder-first routing: while a reminder is active, its acknowledgement
        // owns all screen gestures; mode navigation is blocked until handled.
        if (reminder_active_) {
            HandleReminderGesture(gesture);
            return;
        }
        switch (mode_) {
        case Mode::Chat:
            HandleChatGesture(gesture);
            break;
        case Mode::FunctionPage:
            HandleFunctionPageGesture(gesture);
            break;
        case Mode::SettingsPage:
            HandleSettingsPageGesture(gesture);
            break;
        case Mode::EmotionLearning:
            HandleEmotionLearningGesture(gesture);
            break;
        }
    }

    void EnterMode(Mode mode)
    {
        if (mode_ == mode) {
            return;
        }
        mode_ = mode;
        ResetModeIdleTimer();
        // A mode is a high-priority presentation: it must not light-sleep (spec §6.1).
        UpdatePowerSaveEligibility();
    }

    void ExitToChat()
    {
        if (mode_ == Mode::Chat) {
            return;
        }
        mode_ = Mode::Chat;
        if (mode_idle_timer_ != nullptr) {
            esp_timer_stop(mode_idle_timer_);
        }
        // Back in the root Chat state: re-allow light sleep if no reminder is up.
        UpdatePowerSaveEligibility();
        // Return to the standby idle presentation (Chat → idle pet animation).
        ResetToStandby();
    }

    void ResetModeIdleTimer()
    {
        if (mode_idle_timer_ == nullptr) {
            return;
        }
        esp_timer_stop(mode_idle_timer_);
        esp_timer_start_once(mode_idle_timer_, kModeIdleTimeoutMs * 1000ULL);
    }

    // Return the display to the presentation appropriate for the current mode:
    // the idle pet animation in Chat, the current emotion/pose inside a mode.
    // Stops any transient animation and cannot permanently overwrite a mode
    // or reminder presentation, so feedback layers stay isolated (spec §3.4).
    void ResetToStandby()
    {
        if (display_ == nullptr) {
            return;
        }
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
        }
        auto* emote = static_cast<emote::EmoteDisplay*>(display_);
        switch (mode_) {
        case Mode::Chat:
            presentation_ = Presentation::Standby;
            emote->RestoreFromReminder();  // restarts the standby idle animation
            break;
        case Mode::EmotionLearning:
            presentation_ = Presentation::Mode;
            ShowEmotionLearningCurrent();
            break;
        case Mode::FunctionPage:
            presentation_ = Presentation::Mode;
            emote->ShowFunctionPage();
            break;
        case Mode::SettingsPage:
            presentation_ = Presentation::Mode;
            emote->ShowSettingsPage(settings_selected_index_, settings_adjusting_,
                                    CurrentSettingsValue());
            break;
        }
    }

    // Per-mode gesture handlers. Note: Pet and Shake must never change mode_.
    void HandleChatGesture(Gesture gesture)
    {
        switch (gesture) {
        case Gesture::SwipeLeft:
            EnterFunctionPage();
            break;
        case Gesture::SwipeRight:
            EnterSettingsPage();
            break;
        case Gesture::LongPress:
            Application::GetInstance().ToggleChatState();
            break;
        case Gesture::Tap:
            // Light touch feedback without leaving Chat.
            ShowTemporaryEmotion("happy", 1500);
            Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
            break;
        case Gesture::Shake:
            // "被摇晃" feedback: shake is meaningful only in Chat (spec §1.3).
            // Other modes' handlers ignore Shake, so it never advances a mode.
            ShowTemporaryEmotion("confused", 1800);
            ESP_LOGI(TAG, "Shake feedback (Chat mode)");
            break;
        default:
            // Ignore mode-only gestures (SwipeUp, SwipeDown, Pet, Shake,
            // ChatToggle, None). A swipe must never toggle chat.
            break;
        }
    }

