huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
        // Auto-snooze an unacknowledged reminder after a delay (bounded retry),
        // so an ignored reminder eventually goes quiet.
        if (reminder_active_ && (now_ms - reminder_shown_ms_) >= kReminderAutoSnoozeMs) {
            reminder_snooze_count_++;
            ESP_LOGI(TAG, "Reminder auto-snoozed (%d/%d)",
                     reminder_snooze_count_, kReminderMaxSnooze);
            if (reminder_snooze_count_ >= kReminderMaxSnooze) {
                reminder_.handled = true;
                reminder_pending_ = false;
                reminder_quiet_until_ms_ = now_ms + kDrinkReminderIntervalMs;
            }
            DismissReminder();
            UnlockReminder();
            return;
        }
        if (reminder_active_) {
            // One reminder is shown; a newly due reminder is deferred until this
            // one is handled.
            UnlockReminder();
            return;
        }

        // Re-present a snoozed (unhandled) drink reminder without resetting the
        // snooze counter. It stays pending until acknowledged or given up, so an
        // ignored reminder reaches kReminderMaxSnooze and goes quiet.
        if (reminder_pending_ && reminder_.type == Reminder::Type::Drink) {
            reminder_active_ = true;
            reminder_shown_ms_ = now_ms;
            ShowNextReminder();
            UnlockReminder();
            return;
        }

        // Fresh drink reminder: only after a resolved/quiet cycle. The counter
        // resets here, on a genuinely new interval.
        bool drink_due = (habit_state_.last_drink_time == 0 ||
                          (now_ms - habit_state_.last_drink_time) >= kDrinkReminderIntervalMs);
        if (drink_due && now_ms >= reminder_quiet_until_ms_) {
            PresentReminder(Reminder::Type::Drink, kDrinkReminderMessage, kDrinkReminderEmotion,
                            Lang::Sounds::OGG_POPUP, true);
            UnlockReminder();
            return;
        }

        // Daily schedule reminders.
        time_t now;
        struct tm timeinfo;
        time(&now);
        localtime_r(&now, &timeinfo);
        for (size_t i = 0; i < kScheduleCount; ++i) {
            const ScheduleEntry& r = kScheduleReminders_[i];
            if (timeinfo.tm_hour == r.hour && timeinfo.tm_min == r.minute) {
                PresentReminder(Reminder::Type::Schedule, r.message, r.emotion,
                                Lang::Sounds::OGG_POPUP, true);
                UnlockReminder();
                return;
            }
        }
        UnlockReminder();
    }

    static void reminder_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr) {
            return;
        }
        // The timer only enqueues; presentation and acknowledgement are owned by
        // the reminder path (ShowNextReminder/DismissReminder via gestures), all
        // serialized through reminder_mutex_.
        self->EnqueueDueReminders();
    }

    void HandleReminderGesture(Gesture gesture)
    {
        LockReminder();
        switch (gesture) {
        case Gesture::Tap:
            if (reminder_.type == Reminder::Type::Drink) {
                // Screen tap confirms "done drinking". MarkDrinkCompleted plays the
                // success feedback and leaves the success face up for its ~3s
                // (emotion_reset_timer returns to neutral), so do NOT force an
                // idle restore on top of it.
                MarkDrinkCompleted();
                reminder_.handled = true;
                reminder_pending_ = false;
                reminder_active_ = false;
                // Return to the standby idle animation after the ~3s success face,
                // so idle pet animation resumes instead of freezing on neutral.
                ArmReminderRestore(kDrinkSuccessDurationMs);
            } else {
                // Schedule acknowledgement: feedback only, no habit change.
                Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
                reminder_.handled = true;
                reminder_pending_ = false;
                DismissReminder();
            }
            break;
        case Gesture::LongPress:
            // Ignore/snooze the reminder; bounded retry, then quiet.
            reminder_snooze_count_++;
            ESP_LOGI(TAG, "Reminder ignored (%d/%d)",
                     reminder_snooze_count_, kReminderMaxSnooze);
            if (reminder_snooze_count_ >= kReminderMaxSnooze) {
                reminder_.handled = true;
                reminder_pending_ = false;
                reminder_quiet_until_ms_ = esp_timer_get_time() / 1000 + kDrinkReminderIntervalMs;
                ESP_LOGI(TAG, "Reminder given up after %d ignores; quiet", reminder_snooze_count_);
            }
            DismissReminder();
            break;
        default:
            // Mode navigation (swipes) is blocked while a reminder is active.
            break;
        }
        UnlockReminder();
    }

    void InitializeReminderTimer()
    {
        esp_timer_create_args_t timer_args = {
            .callback = &reminder_timer_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "reminder",
            .skip_unhandled_events = true,
        };
        esp_timer_create(&timer_args, &reminder_timer_);
        // Check every minute (60 seconds = 60000000 us)
        esp_timer_start_periodic(reminder_timer_, 60 * 1000000);
        ESP_LOGI(TAG, "Reminder timer started");
    }

    void ShowTemporaryEmotion(const char* emotion, uint32_t duration_ms)
    {
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        presentation_ = Presentation::TransientFeedback;
        display_->SetEmotion(emotion);
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_start_once(emotion_reset_timer_, static_cast<uint64_t>(duration_ms) * 1000ULL);
        }
    }

    // Outer capacitive "pet" surface: feedback-only touch. A single recognized
    // touch is routed as Gesture::Pet once per debounced interaction (cooldown
    // in outer_touch_last_us_). Pet never changes mode, toggles chat, advances
    // an emotion, or records a drink. (Waking the device is handled separately.)
    void HandleOuterTouchPet()
    {
        const int64_t now = esp_timer_get_time();
        if ((now - outer_touch_last_us_) < kOuterTouchCooldownUs) {
            return;
        }
        outer_touch_last_us_ = now;
        OnGesture(Gesture::Pet);
        // While a reminder is active, it is the highest-priority presentation
        // (spec §3.4): suppress pet feedback so it does not overwrite it.
        if (!reminder_active_) {
            ShowTemporaryEmotion("happy", 2000);
        }
    }

    // ---- Two-level power save (spec §6.1 / §6.2) ------------------------------

