huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    // Called on every interaction (gesture, BOOT, reminder, mode entry, audio):
    // reset both power-save countdowns and wake the display from level-1 sleep.
    void TouchPowerSaveActivity()
    {
        display_idle_ticks_ = 0;
        if (power_save_timer_ != nullptr) {
            // Resets its count and, if the chip woke from a light sleep, exits
            // sleep mode (restoring wake word, CPU config, and the display).
            power_save_timer_->WakeUp();
        }
        WakeDisplay();
    }

    // Level-1: turn off the display and backlight. Wake word/audio stay on.
    void EnterDisplayPowerSave()
    {
        if (display_sleep_active_) {
            return;
        }
        display_sleep_active_ = true;
        if (display_ != nullptr) {
            display_->SetPowerSaveMode(true);
        }
        if (backlight_ != nullptr) {
            backlight_->SetBrightness(0);
        }
        ESP_LOGI(TAG, "Display sleep after %ds idle (wake word stays on)",
                 kDisplaySleepTimeoutSeconds);
    }

    // Restore the backlight and the presentation for the current mode.
    void WakeDisplay()
    {
        if (!display_sleep_active_) {
            return;
        }
        display_sleep_active_ = false;
        if (backlight_ != nullptr) {
            backlight_->RestoreBrightness();
        }
        if (display_ != nullptr) {
            display_->SetPowerSaveMode(false);
        }
        ResetToStandby();
        ESP_LOGI(TAG, "Display woken");
    }

    // Arm the wake sources for level-2 light sleep. The outer capacitive pad is
    // the preferred wake source (spec §6.2): esp_sleep_enable_touchpad_wakeup()
    // uses the TOUCH_PAD1/TOUCH_PAD2 channels the cap sensor already configured.
    void ConfigureWakeSources()
    {
        esp_sleep_enable_touchpad_wakeup();
#if VOCAT_ENABLE_GPIO_WAKEUP
        // Fallback wake sources: LCD touch INT (GPIO10) and BOOT (GPIO0), both
        // active-low. ESP32-S3 light-sleep GPIO wake is level based and each pin
        // is armed individually with gpio_wakeup_enable(). Left off until the
        // board's polarity and wake capability are confirmed on hardware.
        gpio_wakeup_enable(TP_PIN_NUM_INT, GPIO_WAKEUP_LOW);
        gpio_wakeup_enable(BOOT_BUTTON_GPIO, GPIO_WAKEUP_LOW);
        esp_sleep_enable_gpio_wakeup();
#endif
    }

    // Step 5: after a light-sleep wake, the first edge can be stale. Reset the
    // LCD touch tracking so the wake touch cannot yield an accidental tap, mode
    // entry, drink confirmation, or chat toggle, and discard any latched cap-pad
    // wake edge. Safe to call from the light-sleep exit path (never from inside
    // a cap-sensor callback). The cap surface only ever yields a feedback-only
    // Pet, so its own edges are benign.
    void ClearStaleWakeTouch()
    {
        if (cst816s_ != nullptr) {
            cst816s_->ResetTouchState();
        }
        swipe_start_recorded_ = false;
        touch_pad_clear_status();
    }

    // Gate level-2 light sleep to the root Chat mode outside a reminder; the
    // PowerSaveTimer itself additionally requires Application::CanEnterSleepMode().
    void UpdatePowerSaveEligibility()
    {
        if (power_save_timer_ == nullptr) {
            return;
        }
        bool eligible = (mode_ == Mode::Chat) && !reminder_active_;
        power_save_timer_->SetEnabled(eligible);
    }

    static void display_sleep_tick_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self != nullptr) {
            self->OnDisplaySleepTick();
        }
    }

    // Level-1 countdown. Only the root Chat mode, with no active reminder and a
    // standby presentation, and only when the application is genuinely idle
    // (kDeviceStateIdle, no audio/protocol activity), may sleep the display.
    void OnDisplaySleepTick()
    {
        if (display_sleep_active_) {
            return;  // already at level 1
        }
        auto& app = Application::GetInstance();
        bool eligible = (mode_ == Mode::Chat) && !reminder_active_ &&
                        (presentation_ == Presentation::Standby) && app.CanEnterSleepMode();
        if (!eligible) {
            display_idle_ticks_ = 0;
            return;
        }
        display_idle_ticks_++;
        if (display_idle_ticks_ >= kDisplaySleepTimeoutSeconds) {
            EnterDisplayPowerSave();
        }
    }

    void InitializePowerSave()
    {
        // Level-2 light sleep via the common PowerSaveTimer. A real cpu_max_freq
        // makes it lower the CPU and (when CONFIG_PM_ENABLE is set) light-sleep,
        // disabling wake-word/audio input through its existing helper behaviour.
        power_save_timer_ = new PowerSaveTimer(240, kLightSleepTimeoutSeconds, -1);
        power_save_timer_->OnEnterSleepMode([this]() {
            ESP_LOGI(TAG, "Entering light sleep (level 2)");
            // Build on level 1: ensure the display/backlight are off.
            display_sleep_active_ = true;
            if (display_ != nullptr) {
                display_->SetPowerSaveMode(true);
            }
            if (backlight_ != nullptr) {
                backlight_->SetBrightness(0);
            }
            ConfigureWakeSources();
        });
        power_save_timer_->OnExitSleepMode([this]() {
            ESP_LOGI(TAG, "Exiting light sleep (woke)");
            ClearStaleWakeTouch();
            // Re-enable the audio codec input, mirroring the level-2 enter
            // path that disabled it (spec §6.2).
            auto* codec = Board::GetInstance().GetAudioCodec();
            if (codec != nullptr) {
                codec->EnableInput(true);
            }
            WakeDisplay();
        });

        // Level-1 display sleep: separate 1s periodic timer, wake word stays on.
        esp_timer_create_args_t sleep_timer_args = {
            .callback = &EspVocat::display_sleep_tick_callback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "sleep_1s",
            .skip_unhandled_events = true,
        };
        ESP_ERROR_CHECK(esp_timer_create(&sleep_timer_args, &display_sleep_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(display_sleep_timer_, 1000000));

        // Begin counting to light sleep; Chat root with no reminder is eligible.
        UpdatePowerSaveEligibility();
        if (power_save_timer_ != nullptr) {
            power_save_timer_->SetEnabled(true);
        }
    }

    static void imu_event_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr || !self->bmi270_ready_) {
            vTaskDelete(NULL);
            return;
        }

        struct bmi2_sens_data prev = {};
        struct bmi2_sens_data cur = {};
        bool has_prev = false;
        int64_t last_shake_ms = 0;
        constexpr int kShakeDeltaThreshold = 20000;
        constexpr int64_t kShakeCooldownMs = 2000;

        while (true) {
            if (Bmi270Motion::ReadAccelRaw(cur)) {
                if (has_prev) {
                    int dx = abs(static_cast<int>(cur.acc.x) - static_cast<int>(prev.acc.x));
                    int dy = abs(static_cast<int>(cur.acc.y) - static_cast<int>(prev.acc.y));
                    int dz = abs(static_cast<int>(cur.acc.z) - static_cast<int>(prev.acc.z));
                    int shake_score = dx + dy + dz;

                    int64_t now_ms = esp_timer_get_time() / 1000;
                    if (shake_score > kShakeDeltaThreshold && (now_ms - last_shake_ms) > kShakeCooldownMs) {
                        last_shake_ms = now_ms;
                        // Shake is a mode-aware gesture: OnGesture() resets the idle
                        // timer and only Chat handles it (spec §1.3/§2.1), so a shake
                        // never silently extends a mode.
                        self->OnGesture(Gesture::Shake);
                    }
                }
                prev = cur;
                has_prev = true;
            }
            vTaskDelay(pdMS_TO_TICKS(80));
        }
    }

    void InitializeI2c()
    {
        i2c_config_t i2c_cfg = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .sda_pullup_en = true,
            .scl_pullup_en = true,
            .master = {
                .clk_speed = 400000,
            },
            .clk_flags = 0,
        };
        shared_i2c_bus_handle_ = i2c_bus_create(I2C_NUM_0, &i2c_cfg);
        if (!shared_i2c_bus_handle_) {
            ESP_LOGE(TAG, "Failed to create shared I2C bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && !CONFIG_I2C_BUS_BACKWARD_CONFIG
        i2c_bus_ = i2c_bus_get_internal_bus_handle(shared_i2c_bus_handle_);
#else
#error "ESP-VoCat board requires i2c_bus_get_internal_bus_handle() support"
#endif
        if (!i2c_bus_) {
            ESP_LOGE(TAG, "Failed to get I2C master handle");
            ESP_ERROR_CHECK(ESP_FAIL);
        }

        temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
        ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));
        ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));
    }
    uint8_t DetectPcbVersion()
        {
            gpio_config_t gpio_conf = {
                .pin_bit_mask = (1ULL << CORDEC_POWER_CTRL),
                .mode = GPIO_MODE_OUTPUT,
                .pull_up_en = GPIO_PULLUP_DISABLE,
                .pull_down_en = GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE
            };
            ESP_ERROR_CHECK(gpio_config(&gpio_conf));
            ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 0));
            vTaskDelay(pdMS_TO_TICKS(50));

