huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
        bool gesture = false;
        if (event == TOUCH_SLIDER_EVENT_LEFT_SWIPE || event == TOUCH_SLIDER_EVENT_RIGHT_SWIPE) {
            gesture = true;
        } else if (event == TOUCH_SLIDER_EVENT_RELEASE) {
            gesture = true;
        }

        if (!gesture) {
            return;
        }

        // The outer capacitive surface is a feedback-only "pet" input.
        self->HandleOuterTouchPet();
    }

    void EnterEmotionLearningMode()
    {
        if (mode_ == Mode::EmotionLearning) {
            return;
        }
        EnterMode(Mode::EmotionLearning);
        current_emotion_index_ = 0;
        ShowEmotionLearningCurrent();
        // Play sound to indicate entering learning mode
        auto& audio = Application::GetInstance().GetAudioService();
        audio.PlaySound(Lang::Sounds::OGG_POPUP);
        vTaskDelay(pdMS_TO_TICKS(150));
        audio.PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Entered emotion learning mode");
    }

    void ExitEmotionLearningMode()
    {
        if (mode_ != Mode::EmotionLearning) {
            return;
        }
        ExitToChat();
        ShowTemporaryEmotion("happy", 2000);
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_SUCCESS);
        ESP_LOGI(TAG, "Exited emotion learning mode");
    }

    void ShowEmotionLearningCurrent()
    {
        if (display_ != nullptr) {
            // Emotion-learning is a Mode presentation: it must not be clobbered
            // by transient feedback or the standby idle animation.
            presentation_ = Presentation::Mode;
            const char* emotion = kEmotionLearningEmotions_[current_emotion_index_];
            display_->SetEmotion(emotion);
            // Render the emotion name label on the learning page.
            static_cast<emote::EmoteDisplay*>(display_)->ShowEmotionLearning(
                kEmotionLearningNames_[current_emotion_index_]);
            ESP_LOGI(TAG, "Emotion: %s (%s)", emotion,
                     kEmotionLearningNames_[current_emotion_index_]);
        }
    }

    void ShowEmotionLearningNext()
    {
        current_emotion_index_ = (current_emotion_index_ + 1) % kEmotionLearningCount;
        ShowEmotionLearningCurrent();
    }

    void EnterFunctionPage()
    {
        if (mode_ == Mode::FunctionPage) {
            return;
        }
        EnterMode(Mode::FunctionPage);
        if (display_ != nullptr) {
            static_cast<emote::EmoteDisplay*>(display_)->ShowFunctionPage();
        }
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
        ESP_LOGI(TAG, "Entered function page");
    }

    void EnterSettingsPage()
    {
        if (mode_ == Mode::SettingsPage) {
            return;
        }
        settings_selected_index_ = 0;
        settings_adjusting_ = false;
        // Seed the cached volume from the codec so the displayed value matches
        // actual output (the codec default may differ from the initial value).
        volume_ = Application::GetInstance().GetAudioService().GetOutputVolume();
        EnterMode(Mode::SettingsPage);
        RenderSettingsPage();
        Application::GetInstance().GetAudioService().PlaySound(Lang::Sounds::OGG_POPUP);
        ESP_LOGI(TAG, "Entered settings page");
    }

    // The active setting's current value: backlight brightness for row 0
    // (from backlight_), output volume (from the cached volume_) for row 1.
    int CurrentSettingsValue() const
    {
        if (settings_selected_index_ == 0) {
            return backlight_ != nullptr ? static_cast<int>(backlight_->brightness()) : 0;
        }
        return volume_;
    }

    // Adjust and live-apply the active setting, clamped to 0-100.
    void AdjustSettingsValue(int delta)
    {
        if (settings_selected_index_ == 0) {
            int value = (backlight_ != nullptr ? static_cast<int>(backlight_->brightness()) : 0) + delta;
            value = value < 0 ? 0 : (value > 100 ? 100 : value);
            if (backlight_ != nullptr) {
                backlight_->SetBrightness(static_cast<uint8_t>(value));
            }
        } else {
            volume_ += delta;
            volume_ = volume_ < 0 ? 0 : (volume_ > 100 ? 100 : volume_);
            Application::GetInstance().GetAudioService().SetOutputVolume(volume_);
        }
        RenderSettingsPage();
    }

    // Redraw the settings page from the current state.
    void RenderSettingsPage()
    {
        if (display_ == nullptr) {
            return;
        }
        static_cast<emote::EmoteDisplay*>(display_)->ShowSettingsPage(
            settings_selected_index_, settings_adjusting_, CurrentSettingsValue());
    }

    static void touch_button_event_callback(touch_button_handle_t handle, uint32_t channel, touch_state_t state, void* cb_arg)
    {
        (void)handle;
        (void)channel;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }

        // Single-pad (PCB v1.0) outer capacitive surface: a touch is recognized
        // once per debounced interaction, on release. It is feedback-only (Pet)
        // and never changes mode, toggles chat, advances an emotion, or records
        // a drink.
        if (state == TOUCH_STATE_INACTIVE) {
            self->HandleOuterTouchPet();
        }
    }

    static void touch_cap_poll_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr) {
                if (self->touch_slider_handle_ != nullptr) {
                    touch_slider_sensor_handle_events(self->touch_slider_handle_);
                } else if (self->touch_button_handle_ != nullptr) {
                    touch_button_sensor_handle_events(self->touch_button_handle_);
                }
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void InitializeCapacitiveTouchPads()
    {
        if (TOUCH_PAD1 == GPIO_NUM_NC) {
            ESP_LOGW(TAG, "Capacitive touch disabled: TOUCH_PAD1 NC");
            return;
        }

        const uint32_t ch1 = TouchChannelFromPadGpio(TOUCH_PAD1);
        if (ch1 == 0) {
            ESP_LOGW(TAG, "TOUCH_PAD1 GPIO %d is not a touch channel (expect GPIO1..GPIO14)", (int)TOUCH_PAD1);
            return;
        }

